//
// workbook-01.js
// 問題番号：01 ~ 09
// 各設問に対するプログラムを{}の中に実装しましょう。
//

const q01 = () => {
  // ----------------------------------------
  // 01. 「Hello World!」を表示する
  // ----------------------------------------
  console.log(`01. 「 Hello World! 」を表示する`);
  console.log("Hello world!")





};

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q02 = () => {
  // ----------------------------------------
  // 02. 「EC」と「C」を連結して「ECC」を表示する
  // ----------------------------------------
  console.log(`02. 「 EC 」と「 C 」を連結して「ECC」を表示する`);
  console.log("EC" + "C")





}

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q03 = () => {
  // ----------------------------------------
  // 03. データの入力と表示
  // ----------------------------------------
  console.log(`03. 好きなメッセージを入力し、コンソールに表示する`);

  let text = prompt(`Q03. メッセージを入力`);
  console.log(text)


}

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q04 = () => {
  // ----------------------------------------
  // 04. ２つの数値を入力して、その合計を表示する
  // ----------------------------------------
  console.log(`04. ２つの数値を入力して、その合計を表示する`);

  let a4 = prompt(`Q04. １つ目の数値を入力`);
  let b4 = prompt(`Q04. ２つ目の数値を入力`);
  a4 = Number(a4);
  b4 = Number(b4)

  console.log(`${a4}+${b4}=${a4 + b4}`)




}

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q05 = () => {
  // ----------------------------------------
  // 05. ２つの数値を入力して、その余りを表示する
  // ----------------------------------------
  console.log(`05. ２つの数値を入力して、その余りを表示する`);

  let a5 = prompt(`Q05. １つ目の数値を入力`);
  let b5 = prompt(`Q05. ２つ目の数値を入力`);

  console.log(`${a5}÷${b5}の余りは${a5 % b5}`)




}

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q06 = () => {
  // ----------------------------------------
  // 06. 2つの整数値を入力して、その和・差・積・商と余りを表示する
  // ----------------------------------------
  console.log(`06. 2つの整数値を入力して、その和・差・積・商・余を表示する`);

  let a6 = prompt(`Q06. １つ目の数値を入力`);
  let b6 = prompt(`Q06. ２つ目の数値を入力`);
  a6 = Number(a6);
  b6 = Number(b6)


  console.log(`一つ目の数値：${a6}二つ目の数値：${b6} 和:${a6 + b6}差:${a6 - b6}積:${a6 * b6}徐:${a6 / b6}`)




}

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q07 = () => {
  // ----------------------------------------
  // 07. 消費税の計算
  // ----------------------------------------
  console.log(`07. 金額と消費税率を入力して、消費税の金額をコンソールに表示する`);

  let a7 = prompt(`Q07. 金額を入力`);
  let b7 = prompt(`Q07. 消費税率を入力（%）`);






}

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q08 = () => {
  // ----------------------------------------
  // 08. 円の面積
  // ----------------------------------------
  console.log(`08. 半径を入力して、円の面積をコンソールに表示する`);

  prompt(`Q08. 円の半径を入力`);



}

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q09 = () => {
  //
  // 09. 小数点の桁数指定
  //
  console.log(`09. ２つの整数を入力して、その除算結果と小数点以下第２位までに丸めた結果をコンソールに表示する`);

  prompt(`Q09. １つ目の数値を入力`);
  prompt(`Q09. ２つ目の数値を入力`);




}

