
//
// workbook-04.js
// 問題番号：20 ~ 23
// 各設問に対するプログラムを{}の中に実装しましょう。
//

const q20 = () => {
  // ----------------------------------------
  // 20. 配列の参照
  // ----------------------------------------
  console.log(`20. 配列にある要素をすべて参照して、その値をコンソールに表示する`);

  




}

const q21 = () => {
  // ----------------------------------------
  // 21. 配列への保存
  // ----------------------------------------
  console.log(`21. 配列に指定した回数の入力した数値を保存して、保存した配列の値をコンソールに表示する`);

  prompt(`Q21. 保存するデータ数を入力`);




}

const q22 = () => {
  // ----------------------------------------
  // 22. 多次元配列の参照
  // ----------------------------------------
  console.log(`22. 多次元配列にある要素を参照してコンソールに表示する`);

  prompt(`Q22. カレッジの選択`);
  prompt(`Q22. コースの選択`);




}

const q23 = () => {
  // ----------------------------------------
  // 23. 配列の参照と保存
  // ----------------------------------------
  console.log(`23. 指定した回数入力した数値を配列に保存して、その数値の和をコンソールに表示する`);

  prompt(`Q23. 保存するデータ数を入力`);
  prompt(`Q23. 数値の入力`);






}
